Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser
The Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser class provides a set of extension methods for querying and parsing values of type Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.DmCreateCommandPrefix
The prefix used by TS core for indicating DM creation commands.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.CreateCommandPrefix
The prefix used by TS core for indicating creation commands.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.FeatureCommandPrefix
The prefix used by TS core for indicating DM commands.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.ModifyCommandParameter
The parameter string for DM modify command.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.IsCreateCommand(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData,System.String@)
Determines whether the command describes a create command.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value to determine the command type for.
targetObjectType: The System.String identifier for the type of object to create.
Returns: True if command describes a create command; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.IsInterrupting(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Returns a value indicating whether the given command indicates an interrupting state.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData to analyze.
Returns: True if the given Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData indicates a system interrupting state; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.ToDescriptor(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData,Tekla.BIM.DirectManipulation.Services.State.CommandDescriptor@)
Converts a Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value coming to a Tekla.BIM.DirectManipulation.Services.State.CommandDescriptor instance.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData to convert.
descriptor: The matching command descriptor, if any.
Returns: True if the command is convertible to a Tekla.BIM.DirectManipulation.Services.State.CommandDescriptor; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.IsCommand(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData,System.String,System.String@)
Determines whether command describes a command identified by the given commandIdentifier.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value to check.
commandIdentifier: The identifier of the command to check.
commandSubstring: The System.String value following commandIdentifier in the command, if any.
Returns: True if command describes a command identified by the given commandIdentifier; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.IsFeatureCommand(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Determines whether the command describes a start command specific for any DM feature.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value to determine the command type for.
Returns: True if command describes a start-feature command; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.IsFeatureCommand(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData,System.String@)
Determines whether the command describes a start command specific for any DM feature.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value to determine the command type for.
featureIdentifier: The System.String identifier for the feature to start.
Returns: True if command describes a start-feature command; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.IsModifyCommand(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Determines whether the command describes a modify command.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value to determine the command type for.
Returns: True if command describes a modify command; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.State.CommandDataParser.IsStartPickCommand(Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData)
Determines whether command describes a start-pick command.
command: The Tekla.Structures.DirectManipulation.Adapter.State.Native.dotCommandData value to determine the command type for.
Returns: True if command describes a start-pick command; otherwise, false.